Tekla Open API Reference for Tekla Structures 2025
Double Operators and Type Conversions
The Double type exposes the following members.
Operators
Name | Description
Equality
 Compares a double value with a Datatype.Double value.
Implicit(Double to Double)
 Converts from double to Datatype.Double.
Implicit(Double to Double)
 Converts from Datatype.Double to double.
Inequality
 Compares a double value with a Datatype.Double value.
Top
See Also
Reference
Double Structure
Tekla.Structures.Datatype Namespace